# Taps
tap "homebrew/bundle"
tap "nikitabobko/tap"           # aerospace

# Shell & Terminal
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "fzf"
brew "lsd"
brew "zoxide"
brew "tmux"
brew "starship"

# Editor & Dev Tools
brew "neovim"
brew "lua-language-server"
brew "stylua"
brew "ripgrep"
brew "fd"
brew "gh"
brew "git"
brew "lazygit"
brew "shellcheck"

# Languages & Runtimes
brew "node"
brew "go"
brew "python@3.13"
brew "uv"
brew "rbenv"
brew "ruby-build"
brew "pnpm"
brew "pipx"

# CLI Utilities
brew "sd"
brew "tree"
brew "hugo"
brew "pandoc"
brew "neofetch"
brew "sk"

# Cask Apps
cask "ghostty"
cask "aerospace"
cask "raycast"
cask "bitwarden"
cask "localsend"
cask "pearcleaner"
cask "beekeeper-studio"
cask "skim"

# Fonts
cask "font-jetbrains-mono-nerd-font"
